In [1]:
%load_ext sql

In [2]:
%sql sqlite:///pandas-sql.db

In [3]:
%pip install sqlite3

ERROR: Could not find a version that satisfies the requirement sqlite3 (from versions: none)
ERROR: No matching distribution found for sqlite3
Note: you may need to restart the kernel to use updated packages.

In [5]:
%%sql
CREATE TABLE IF NOT EXISTS employees (
    employee_id INTEGER PRIMARY KEY AUTOINCREMENT,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    department VARCHAR(50),
    salary DECIMAL(10, 2) NOT NULL
);

 * sqlite:///pandas-sql.db
Done.

[]

In [6]:
%%sql
ALTER TABLE employees
ADD hire_date DATE;

ALTER TABLE employees
ADD performance_rating INT;

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating) 
VALUES (1, 'John', 'Doe', 'Sales', 50000.00, '2024-04-23', 3);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating) 
VALUES (2, 'Jane', 'Smith', 'Marketing', 55000.00, '2024-04-25', 4);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating) 
VALUES (3, 'Michael', 'Johnson', 'Sales', 60000.00, '2024-04-26', 5);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating) 
VALUES (4, 'Emily', 'Davis', 'Operations', 62000.00, '2024-04-27', 2);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating) 
VALUES (5, 'David', 'Wilson', 'Operations', 58000.00, '2024-04-28', 1);

 * sqlite:///pandas-sql.db
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [7]:
%sql SELECT * FROM employees;

 * sqlite:///pandas-sql.db
Done.

[(1, 'John', 'Doe', 'Sales', 50000, '2024-04-23', 3),
 (2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-25', 4),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-26', 5),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-27', 2),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1)]

In [10]:
import sqlite3
import pandas as pd

# Create a connection.
conn = sqlite3.connect('pandas-sql.db')
df = pd.read_sql_query("SELECT * FROM employees", conn)

# Insert pandas code
df

# (Optional)
conn.commit()
conn.close()